Atalov S. (TSI AUCA)

Introduction to Machine Learning

# Kaggle Competition: Titanic

---

In [388]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import StandardScaler
from sklearn.linear_model import LogisticRegression, LinearRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.metrics import accuracy_score

In [389]:
titanic_train = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/train.csv'
titanic_test = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/test.csv'
example = 'https://raw.githubusercontent.com/lobachevksy/teaching/main/titanic/example_submission.csv'

In [390]:
df = pd.read_csv(titanic_train)

In [391]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## 1. Data Preparation

In [392]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

#### Drop unnecessary columns

In [393]:
df = df.drop(columns=["PassengerId", "Name", "Cabin", "Ticket"])
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

#### Handling non-numeric columns

In [394]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [395]:
df["Sex"].replace({ }, inplace=True)

In [396]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

#### Missing values (NaN	)

In [397]:
# check if there any missing values
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  889 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

In [398]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [421]:
# Определение самого часто встречающегося значения в столбце "Embarked"
most_common_embarked = df['Embarked'].mode()[0]

# Заполнение пропущенных значений в столбце "Embarked" самым часто встречающимся значением
df['Embarked'].fillna(most_common_embarked, inplace=True)
mean_age = df['Age'].mean()
df['Age'].fillna(mean_age, inplace=True)
# Оценка качества заполнения (опционально)
# Здесь можно вывести количество заполненных значений и сравнить с изначальным количеством пропущенных значений

# Использование обновленных данных для анализа или моделирования
# Теперь df содержит заполненные пропущенные значения в столбце "Embarked"

In [422]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [423]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    object
 3   Age       891 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
 7   Embarked  891 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

#### One-hot encoding

In [424]:
df = pd.get_dummies(df, columns=["Sex", "Embarked"])

#### Split into X and y

In [425]:
X = df.drop(columns=["Survived"])  # все столбцы, кроме "Survived", являются признаками
y = df["Survived"]  # столбец "Survived" является целевой переменной

#### Train-Test-Split

In [426]:
from sklearn.model_selection import train_test_split as tts

In [427]:
X_train, X_test, y_train, y_test = tts(X, y, test_size=0.2)

###### Data is ready for modeling!

## 2. Modelling

Fit the model (Logistic Regression) and show scores on training and test datasets.

In [428]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression

# Разделение данных на обучающий и тестовый наборы
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

# Создание и обучение модели логистической регрессии
model = LogisticRegression(max_iter=1000)
model.fit(X_train, y_train)

# Оценка производительности модели на обучающем наборе данных
train_accuracy = model.score(X_train, y_train)
print("Accuracy on training set:", train_accuracy)

# Оценка производительности модели на тестовом наборе данных
test_accuracy = model.score(X_test, y_test)
print("Accuracy on test set:", test_accuracy)

Accuracy on training set: 0.8047752808988764
Accuracy on test set: 0.7988826815642458

## 3. Making Predictions

In [444]:
df_test = pd.read_csv(titanic_test)
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [445]:
submission = df_test[["PassengerId"]]
submission

     PassengerId
0            892
1            893
2            894
3            895
4            896
..           ...
413         1305
414         1306
415         1307
416         1308
417         1309

[418 rows x 1 columns]

#### Prepare the test data in the same way as train data!

In [446]:
df_test = df_test.drop(columns=["PassengerId", "Name", "Ticket", "Cabin"])

df_test = pd.get_dummies(df_test, ["Sex","Embarked"])

In [447]:
df_test.isnull().sum()

Pclass         0
Age           86
SibSp          0
Parch          0
Fare           1
Sex_female     0
Sex_male       0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
dtype: int64

### TASK: Fill the missing values in Age and Fare columns with mean values

In [448]:
# Заполнение пропущенных значений возраста средним
mean_age = df_test['Age'].mean()
df_test['Age'].fillna(mean_age, inplace=True)

# Заполнение пропущенных значений тарифа средним
mean_fare = df_test['Fare'].mean()
df_test['Fare'].fillna(mean_fare, inplace=True)

In [449]:
df_test

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,3,34.50000,0,0,7.8292,False,True,False,True,False
1,3,47.00000,1,0,7.0000,True,False,False,False,True
2,2,62.00000,0,0,9.6875,False,True,False,True,False
3,3,27.00000,0,0,8.6625,False,True,False,False,True
4,3,22.00000,1,1,12.2875,True,False,False,False,True
...,...,...,...,...,...,...,...,...,...,...
413,3,30.27259,0,0,8.0500,False,True,False,False,True
414,1,39.00000,0,0,108.9000,True,False,True,False,False
415,3,38.50000,0,0,7.2500,False,True,False,False,True
416,3,30.27259,0,0,8.0500,False,True,False,False,True
417,3,30.27259,1,1,22.3583,False,True,True,False,False

### TASK: Make a predictions using the estimated Logistic Regression Model and save results into `Survived` column of `submission` dataframe

In [450]:
# Make predictions using the trained Logistic Regression model
predictions = model.predict(df_test)

submission["Survived"] = predictions

### Saving the results:

In [451]:
submission.to_csv("my_prediction.csv", index=False)

#### Submit the results in Kaggle!!!

<img src="https://i.imgflip.com/3nc2l0.jpg">